Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLineAttributes Class
 The GridLineAttributes class is the attributes class for the grid line.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GridLine.GridLineAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class GridLineAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class GridLineAttributes
	Inherits AttributesBase
The GridLine.GridLineAttributes type exposes the following members.
Constructors
Name | Description
GridLine.GridLineAttributes()
 Creates a new default grid line attributes instance that loads standard attributes.
GridLine.GridLineAttributes(String)
 Creates a new grid line attributes instance that loads the specified attributes.
Top
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the object type
DrawOnlyTextLabelsNotGridLines
 Set as true if you don't want to draw the grid lines, only show the grid lines' text labels.
DrawTextAtEndOfGridLine
 Set as true if you want to show the grid line's text label at the end of the line.
DrawTextAtStartOfGridLine
 Set as true if you want to show the grid line's text label at the start of the line.
Font
 The grid line's font attributes.
Frame
 The frame attributes of the grid line's label.
Line
 The grid line's line attributes.
OffsetAtEndOfLine
 The offset for the end of the grid line.
OffsetAtStartOfLine
 The offset for the beginning of the grid line.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace